====== Recover a Cisco IOS Catalyst 2948G Layer 2 Switch in Rommon Mode ======



The issue was that I had an incorrect CatOS image cat4000-k8.8-4-7-GLX.bin installed and needed to issue the correct CatOS image designed for the Cisco 2948G Layer2 switch.  The latest CatOS image for the 2948G Layer 2 switch is the cat4000.5-5-21.bin.  The 2948G-L3 uses an IOS image and cannot be used with the 2948G Layer 2 switch.  I was able to find documentaiton on Cisco’s website, “Recovering Catalyst Switches Running CatOS from Booting Failures” Document ID: 17052 and was relevant for bootstrap version 4.4(1).  The bootstrap version I have in my Cisco 2948G Layer2 was System Bootstrap Version: 5.4(1) and was off by a few commands.  So, I decided to touch up on it.

Below are the steps I’ve done to  recover the 2948G L2 switch.  I’ve included the commands I’ve typed along with the output generated from each command.  In these examples, my network is 192.168.1.0 /24.  Please adjust the IP addresses to fit your own network.  My TFTP server in this example is 192.168.1.61.

Disclaimer: I should note that these steps are what worked for me in my situation.  Any such opinion, advice, statement, or other information shall be at your own risk and I assume no responsibility.

===== Recovery Procedure =====
<code>
rommon 1 > set
PS1=rommon ! >
MemorySize=64
ResetCause=198
TmpfsAddr=2197815296
TmpfsSize=12582912
TmpfsDirectorySize=10240
DiagFreePageLimit=12288
AutobootStatus=fail
?=0
BOOT=bootflash:cat4000-k8.8-4-7-GLX.bin,1;
ROMVERSION=5.4(1)
</code>
 
===== Setting up MGMT Interface for TFTP =====
<code>
rommon 7 > set interface me1 192.168.1.250 255.255.255.0
3:37.497852: No gateway has been specified
3:37.498725: Please set TftpServer variable to do tftp downloads
3:37.500252: ig0: 00:01:c7:61:cf:fe is 192.168.1.250
3:37.500995: netmask: 255.255.255.0
3:37.501414: broadcast: 192.168.1.255
3:37.501858: gateway: 0.0.0.0
rommon 8 > set ip route default 192.168.1.1
rommon 9 > set
PS1=rommon ! >
MemorySize=64
ResetCause=198
TmpfsAddr=2197815296
TmpfsSize=12582912
TmpfsDirectorySize=10240
DiagFreePageLimit=12288
AutobootStatus=fail
?=0
BOOT=bootflash:cat4000-k8.8-4-7-GLX.bin,1;
ROMVERSION=5.4(1)
rommon 10 > ping 192.168.1.61    <– make sure you can reach the TFTP server on your network.
192.168.1.61 is alive
</code>
 
===== TFTP Setup – Booting from a TFTP Server =====
<code>
rommon 23 > TftpServer=192.168.1.61
rommon 24 > set
PS1=rommon ! >
MemorySize=64
ResetCause=198
TmpfsAddr=2197815296
TmpfsSize=12582912
TmpfsDirectorySize=10240
DiagFreePageLimit=12288
AutobootStatus=fail
TFTP_SERVER=192.168.1.61
DiagBootMode=post
TftpServer=192.168.1.61
?=0
BOOT=bootflash:cat4000-k8.8-4-7-GLX.bin,1;
ROMVERSION=5.4(1)
WHICHBOOT=tftp://192.168.1.61/cat4000.5-5-21.bin
rommon 25 >
rommon 28 > boot cat4000.5-5-21.bin
19:36.186248: Loading file 192.168.1.61:cat4000.5-5-21.bin
20:24.052553: 3963376 bytes received (checksum 0xbf04)
##############################
Starting Off-line Diagnostics
Mapping in TempFs
Board type is WS-X2948
DiagBootMode value is “post”
Loading diagnostics…
Power-on-self-test for Module 1:  WS-X2948
Status: (. = Pass, F = Fail)
processor: .           cpu sdram: .           eprom: .              
nvram: .               flash: .               enet console port: .  
switch registers: .    switch sram: .        
Module 1 Passed
Exiting Off-line Diagnostics
bad log
Cisco Systems, Inc. Console
1999 Dec 31 23:00:00 %SYS-4-NVLOG:convertCiscoMIB:Nvram unconvertible: 16402(7)
1999 Dec 31 23:00:00 %SYS-4-NVLOG:supVersion:Nmp version 5.5(21)
1999 Dec 31 23:00:00 %SYS-5-MOD_OK:Module 1 is online
Enter password: 1999 Dec 31 23:00:08 %SYS-5-MOD_OK:Module 2 is online
Console> en
Enter password:
Console> (enable)
<code>
 

===== Copy CatOS from TFTP to Flash =====
<code>
Console> (enable) ping 192.168.1.61             
192.168.1.61 is alive
Console> (enable) copy tftp flash
IP address or name of remote host []? 192.168.1.61
Name of file to copy from []? cat4000.5-5-21.bin
Flash device [bootflash]?
Name of file to copy to [cat4000.5-5-21.bin]?
6729100 bytes available on device bootflash, proceed (y/n) [n]? y
CCCCCCCCC
File has been copied successfully.
Console> (enable)
Console> (enable) dir bootflash:
-#- -length- —–date/time—— name
1  4804980 Dec 31 1999 23:08:16 cat4000-k8.8-4-7-GLX.bin
2  3963376 Dec 31 1999 23:02:33 cat4000.5-5-21.bin
2765724 bytes available (8768612 bytes used)
Console> (enable)
</code>
 
===== To Verify Integrity of the CatOS Image =====
<code>
Console> (enable) verify bootflash:cat4000.5-5-21.bin
CCCCCCCCCCCCCCCCCCCStarting verification on file bootflash:cat4000.5-5-21.bin.
………………………………………………………………………………………………………………
File bootflash:cat4000.5-5-21.bin verified and is Ok.
Console> (enable)
</code>
 
===== To booting up your new CatOS image =====
<code>Console> (enable) set boot system flash bootflash:cat4000.5-5-21.bin</code> 

===== Verify Your Config-Register and Your CatOS boot sequence =====
<code>
Console> (enable) show boot
BOOT variable = bootflash:cat4000-k8.8-4-7-GLX.bin,1;bootflash:cat4000.5-5-21.bin,1;
CONFIG_FILE variable =
Configuration register is 0×0
ignore-config: disabled
auto-config: non-recurring
console baud: 9600
boot: the ROM monitor
Console> (enable)
</code>

<code>
You will notice that the BOOT variable still shows the incorrect CatOS image cat4000-k8.8-4-7-GLX.bin 
booting up first.  You will also notice that my Configuration register is 0×0 and will still boot in to
Rommon.  I’ll also show you how to squeeze and delete the old CatOS.  The steps below are how to make 
these three changes.

If you have 2 CatOS images present in your flash, you can use the prepend option at the end of the set
boot system command to boot up that image


Console> (enable) set boot system flash bootflash:cat4000.5-5-21.bin prepend
BOOT variable = bootflash:cat4000.5-5-21.bin,1;bootflash:cat4000-k8.8-4-7-GLX.bin,1;
Console> (enable)
</code>
 
===== Change Your Config-Register boot up from flash =====
<code>
Console> (enable) set boot config-register 0×2102
Configuration register is 0×2102
ignore-config: disabled
auto-config: non-recurring
console baud: 9600
boot: image specified by the boot system commands
Console> (enable)
</code>
 

===== To verify your changes made =====
<code>
Console> (enable) sh config system
This command shows non-default configurations only.
Use ‘show config system all’ to show both default and non-default configurations.
…..
..
begin
!
# ***** NON-DEFAULT CONFIGURATION *****
!
!
#time: Fri Dec 31 1999, 23:24:44
!
#version 5.5(21)
!
!
#system web interface version(s)
!
#frame distribution method
set port channel all distribution mac both
!
#ip
set interface sl0 down
set interface me1 192.168.1.250 255.255.255.0 192.168.1.255
!

#set boot command
set boot config-register 0×2102
set boot system flash bootflash:cat4000.5-5-21.bin
set boot system flash bootflash:cat4000-k8.8-4-7-GLX.bin
end
Console> (enable)
</code>

===== Reset to verify if CatOS boots up properly =====
<code>Console> (enable) reset</code>

===== This command will reset the system. =====
<code>
Do you want to continue (y/n) [n]? y
1999 Dec 31 23:25:15 %SYS-5-SYS_RESET:System reset from Console//
Console> (enable) 0:00.571875: No gateway has been specified
0:00.573689: ig0: 00:01:c7:61:cf:fe is 192.168.1.250
0:00.574430: netmask: 255.255.255.0
0:00.574847: broadcast: 192.168.1.255
0:00.575289: gateway: 0.0.0.0
WS-C2948G bootrom version 5.4(1), built on 2000.04.04 10:48:54
H/W Revisions:    Fin: 2    Head: 6    Board: 1
Supervisor MAC addresses: 00:01:c7:61:cc:00 through 00:01:c7:61:cf:ff (1024 addresses)
Installed memory: 64 MB
Testing LEDs…. done!
The system will autoboot in 5 seconds.
Type control-C to prevent autobooting.
rommon 1 >
The system will now begin autobooting.
Autobooting image: “bootflash:cat4000.5-5-21.bin”
CCCCCCCCCCCCCCCCC##############################
Starting Off-line Diagnostics
Mapping in TempFs
Board type is WS-X2948
DiagBootMode value is “post”
Loading diagnostics…
Power-on-self-test for Module 1:  WS-X2948
Status: (. = Pass, F = Fail)
processor: .           cpu sdram: .           eprom: .              
nvram: .               flash: .               enet console port: .  
switch registers: .    switch sram: .        
Module 1 Passed
Exiting Off-line Diagnostics
Cisco Systems, Inc. Console
1999 Dec 31 23:26:05 %SYS-5-MOD_OK:Module 1 is online
Enter password: 1999 Dec 31 23:26:13 %SYS-5-MOD_OK:Module 2 is online

Console> en
Enter password:
Console> (enable) sh ver
WS-C2948 Software, Version NmpSW: 5.5(21)
Copyright (c) 1995-2005 by Cisco Systems, Inc.
NMP S/W compiled on May 18 2005, 20:20:58
GSP S/W compiled on May 18 2005, 17:48:59
System Bootstrap Version: 5.4(1)
Hardware Version: 2.3  Model: WS-C2948  Serial #: XXXXXXXXXXX
Mod Port Model      Serial #              Versions
 — —- ———- ——————– ———————————
 1   0    WS-X2948   XXXXXXXXXXX          Hw : 2.3
                                          Gsp: 5.5(21.0)
                                          Nmp: 5.5(21)
 2   50   WS-C2948G  XXXXXXXXXXX          Hw : 2.3

           DRAM                    FLASH                   NVRAM
    Module Total   Used    Free    Total   Used    Free    Total Used  Free
    —— ——- ——- ——- ——- ——- ——- —– —– —–
    1       65536K  26548K  38988K  12288K   9588K   2700K  480K  148K  332K
    Uptime is 0 day, 0 hour, 2 minutes

Console> (enable)
</code> 

===== To delete and squeeze the old CatOS =====
<code>
I want to delete the incorrect CatOS image cat4000-k8.8-4-7-GLX.bin from flash and perform 
a squeeze it to remove it from flash. 

Console> (enable) sh flash
-#- ED –type– –crc— -seek– nlen -length- —–date/time—— name
1 .. ffffffff d720d3d5  4d51f4   24  4804980 Dec 31 1999 23:08:16 cat4000-k8.8-4-7-GLX.bin
2 .. ffffffff 8a379198  89cc64   18  3963376 Dec 31 1999 23:02:33 cat4000.5-5-21.bin
2765724 bytes available (8768612 bytes used)

Console> (enable) delete bootflash:cat4000-k8.8-4-7-GLX.bin
</code>

===== After deleting the old CatOS, you will notice that it still remains in flash =====
<code>
Console> (enable) show flash
-#- ED –type– –crc— -seek– nlen -length- —–date/time—— name
1 .D ffffffff d720d3d5  4d51f4   24  4804980 Dec 31 1999 23:08:16 cat4000-k8.8-4-7-GLX.bin
2 .. ffffffff 8a379198  89cc64   18  3963376 Dec 31 1999 23:02:33 cat4000.5-5-21.bin
2765724 bytes available (8768612 bytes used)
Console> (enable)
</code>

===== But a dir command only shows one CatOS =====
<code>
Console> (enable) dir
-#- -length- —–date/time—— name
2  3963376 Dec 31 1999 23:02:33 cat4000.5-5-21.bin
2765724 bytes available (8768612 bytes used)

Console> (enable)
</code>

===== You need to squeeze flash. =====
<code>
Issue this command:

Console> (enable) squeeze bootflash:
All deleted files will be removed, proceed (y/n) [n]? y
Squeeze operation may take a while, proceed (y/n) [n]? y
Erasing squeeze log   
Console> (enable)

Console> (enable) sh flash
-#- ED –type– –crc— -seek– nlen -length- —–date/time—— name
1 .. ffffffff 8a379198  407a70   18  3963376 Dec 31 1999 23:02:33 cat4000.5-5-21.bin
7570832 bytes available (3963504 bytes used)
Console> (enable)
</code>
    
